<a href="https://colab.research.google.com/github/SONYOUNGSOO/PythonTest/blob/main/pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#1. Mount Drive

In [2]:
from google.colab import drive
drive.mount('/gdrive')

Drive already mounted at /gdrive; to attempt to forcibly remount, call drive.mount("/gdrive", force_remount=True).

In [3]:
!ls -al '/gdrive/My Drive/data'

total 2169852
-rw------- 1 root root     52512 Feb  1 01:51 ETC_75_04_01_580736.csv
-rw------- 1 root root 738556069 Apr  1  2020 TCS_11_03_02_377727.csv
-rw------- 1 root root 699429059 Mar  1  2020 TCS_11_03_02_447126.csv
-rw------- 1 root root 783889122 Feb  1  2020 TCS_11_03_02_598345.csv

#2. Load Data

In [4]:
import pandas as pd

In [5]:
#Load a file under "data" folder
file = "/gdrive/My Drive/data/TCS_11_03_02_598345.csv"
data = pd.read_csv(file, sep=",",encoding="euc-kr")

In [6]:
data.head()

       집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간  Unnamed: 6
0  20200101   17        0      101          3    -1         NaN
1  20200101   17        0      101          1    -1         NaN
2  20200101    9        0      101          2    -1         NaN
3  20200101    9        0      101          1    -1         NaN
4  20200101    7        0      101          1    -1         NaN

In [7]:
data.head(10)

       집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간  Unnamed: 6
0  20200101   17        0      101          3    -1         NaN
1  20200101   17        0      101          1    -1         NaN
2  20200101    9        0      101          2    -1         NaN
3  20200101    9        0      101          1    -1         NaN
4  20200101    7        0      101          1    -1         NaN
5  20200101    9        0      101          3    -1         NaN
6  20200101    6        0      101          1    -1         NaN
7  20200101    6        0      101          3    -1         NaN
8  20200101    7        0      101          3    -1         NaN
9  20200101   19        0      101          1    -1         NaN

In [8]:
data.tail()

              집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드   통행시간  Unnamed: 6
25596211  20200131    9      272      641          1   8388         NaN
25596212  20200131   15      137      245          3   2341         NaN
25596213  20200131    6      127      612          5  42535         NaN
25596214  20200131    6      671      127          1   9494         NaN
25596215  20200131   17      212      253          3    833         NaN

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25596216 entries, 0 to 25596215
Data columns (total 7 columns):
 #   Column      Dtype
---  ------      -----
 0   집계일자        int64
 1   집계시         int64
 2   출발영업소코드     int64
 3   도착영업소코드     int64
 4   TCS차종구분코드   int64
 5   통행시간        int64
 6   Unnamed: 6  float64
dtypes: float64(1), int64(6)
memory usage: 1.3 GB

#3.Clean Data

In [10]:
#Checking null value
data.isnull().sum(axis=0)

집계일자                 0
집계시                  0
출발영업소코드              0
도착영업소코드              0
TCS차종구분코드            0
통행시간                 0
Unnamed: 6    25596216
dtype: int64

In [11]:
#show columns of the dta frame
data.columns

Index(['집계일자', '집계시', '출발영업소코드', '도착영업소코드', 'TCS차종구분코드', '통행시간', 'Unnamed: 6'], dtype='object')

In [12]:
data.columns[1]

'집계시'

In [13]:
#drop smoe columns with null values
data_clean = data.drop(['Unnamed: 6'],axis ='columns')

In [14]:
data_clean.head()

       집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간
0  20200101   17        0      101          3    -1
1  20200101   17        0      101          1    -1
2  20200101    9        0      101          2    -1
3  20200101    9        0      101          1    -1
4  20200101    7        0      101          1    -1

In [15]:
(data_clean.통행시간 > 0).unique()

array([False,  True])

In [16]:
data_clean.통행시간 > 0

0           False
1           False
2           False
3           False
4           False
            ...
25596211     True
25596212     True
25596213     True
25596214     True
25596215     True
Name: 통행시간, Length: 25596216, dtype: bool

In [17]:
data_clean = data_clean[data_clean.통행시간 > 0] # 0보다 큰 내용만 넣는다.

In [18]:
data_clean.head()

          집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간
5853  20200101   22      101      102          6   632
5854  20200101   22      101      102          3   633
5855  20200101   16      101      102          6   650
5856  20200101   16      101      102          1   623
5857  20200101   16      101      102          3   626

In [19]:
#select by ',' Operator
data.집계일자

0           20200101
1           20200101
2           20200101
3           20200101
4           20200101
              ...
25596211    20200131
25596212    20200131
25596213    20200131
25596214    20200131
25596215    20200131
Name: 집계일자, Length: 25596216, dtype: int64

In [20]:
#select by [] Operator
data['집계일자']

0           20200101
1           20200101
2           20200101
3           20200101
4           20200101
              ...
25596211    20200131
25596212    20200131
25596213    20200131
25596214    20200131
25596215    20200131
Name: 집계일자, Length: 25596216, dtype: int64

In [21]:
data['Unnamed: 6']

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
            ..
25596211   NaN
25596212   NaN
25596213   NaN
25596214   NaN
25596215   NaN
Name: Unnamed: 6, Length: 25596216, dtype: float64

#4. Data Select Data

In [22]:
data_clean.head()

          집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간
5853  20200101   22      101      102          6   632
5854  20200101   22      101      102          3   633
5855  20200101   16      101      102          6   650
5856  20200101   16      101      102          1   623
5857  20200101   16      101      102          3   626

In [23]:
data_clean[0:5]

          집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간
5853  20200101   22      101      102          6   632
5854  20200101   22      101      102          3   633
5855  20200101   16      101      102          6   650
5856  20200101   16      101      102          1   623
5857  20200101   16      101      102          3   626

In [24]:
df_data= pd.DataFrame(data_clean, columns=['집계일자','집계시','출발영업소코드','도착영업소코드','통행시간']) #필요한 칼럼 선택 가능

In [25]:
df_data.head()

          집계일자  집계시  출발영업소코드  도착영업소코드  통행시간
5853  20200101   22      101      102   632
5854  20200101   22      101      102   633
5855  20200101   16      101      102   650
5856  20200101   16      101      102   623
5857  20200101   16      101      102   626

In [37]:
long_distance = df_data.통행시간 > 700

In [36]:
long_distance

5853        False
5854        False
5855        False
5856        False
5857        False
            ...
25596211     True
25596212     True
25596213     True
25596214     True
25596215     True
Name: 통행시간, Length: 21531295, dtype: bool

In [34]:
df_data.출발영업소코드 == 101

5853         True
5854         True
5855         True
5856         True
5857         True
            ...
25596211    False
25596212    False
25596213    False
25596214    False
25596215    False
Name: 출발영업소코드, Length: 21531295, dtype: bool

In [39]:
start_from_101 = df_data[df_data.출발영업소코드 == 101]  # 101만 가져온것

In [40]:
start_from_101

              집계일자  집계시  출발영업소코드  도착영업소코드   통행시간
5853      20200101   22      101      102    632
5854      20200101   22      101      102    633
5855      20200101   16      101      102    650
5856      20200101   16      101      102    623
5857      20200101   16      101      102    626
...            ...  ...      ...      ...    ...
25595893  20200131    8      101      596  28576
25595991  20200131   17      101      698  16752
25596003  20200131   15      101      705   2587
25596023  20200131    1      101      175   1769
25596210  20200131    4      101      601   3202

[269409 rows x 5 columns]

In [41]:
#101,서울 105,기흥 110,목천 115,대전 120,황간 125,남구미 130,동김천 135,경주 140,부산

In [42]:
start_from_101_to_140 = start_from_101[start_from_101['도착영업소코드'].isin([105,110,115,120,125,130,135,140])]

In [43]:
start_from_101_to_140

              집계일자  집계시  출발영업소코드  도착영업소코드   통행시간
6079      20200101    4      101      105    637
6080      20200101    4      101      105    773
6081      20200101    4      101      105    762
6082      20200101    4      101      105    746
6083      20200101    4      101      105    875
...            ...  ...      ...      ...    ...
25574957  20200131   10      101      125   7776
25575802  20200131    2      101      140  14189
25584233  20200131    4      101      110   3780
25586486  20200131   15      101      120   8269
25595750  20200131   18      101      130   9769

[12749 rows x 5 columns]

In [44]:
start_from_101_to_140.value_counts()

집계일자      집계시  출발영업소코드  도착영업소코드  통행시간
20200116  14   101      110      3546    2
20200104  3    101      105      770     2
20200106  8    101      105      976     2
20200124  14   101      105      845     2
20200120  10   101      105      877     2
                                        ..
20200121  5    101      105      788     1
                                 729     1
                                 651     1
                                 629     1
20200101  0    101      105      616     1
Length: 12717, dtype: int64

#5. Insert Data

In [48]:
# 1 : by declaring a new list as a column
start_from_101_to_140['요일'] = pd.to_datetime(start_from_101_to_140['집계일자'],format='%Y%m%d').dt.dayofweek

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [49]:
start_from_101_to_140.head()

          집계일자  집계시  출발영업소코드  도착영업소코드  통행시간  요일
6079  20200101    4      101      105   637   2
6080  20200101    4      101      105   773   2
6081  20200101    4      101      105   762   2
6082  20200101    4      101      105   746   2
6083  20200101    4      101      105   875   2

In [51]:
#2 : Using .loc[]
start_from_101_to_140.loc[:,'요일'] = pd.to_datetime(start_from_101_to_140['집계일자'], format = '%Y%m%d').dt.dayofweek

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1781: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item_labels[indexer[info_axis]]] = value

In [52]:
start_from_101_to_140.head()

          집계일자  집계시  출발영업소코드  도착영업소코드  통행시간  요일
6079  20200101    4      101      105   637   2
6080  20200101    4      101      105   773   2
6081  20200101    4      101      105   762   2
6082  20200101    4      101      105   746   2
6083  20200101    4      101      105   875   2

In [54]:
#3. Using the .assign()
start_from_101_to_140 = start_from_101_to_140.assign(요일=pd.to_datetime(start_from_101_to_140['집계일자'],format = '%Y%m%d').dt.dayofweek)

In [55]:
start_from_101_to_140.head()

          집계일자  집계시  출발영업소코드  도착영업소코드  통행시간  요일
6079  20200101    4      101      105   637   2
6080  20200101    4      101      105   773   2
6081  20200101    4      101      105   762   2
6082  20200101    4      101      105   746   2
6083  20200101    4      101      105   875   2

In [57]:
start_from_101_to_140.dtypes

집계일자       int64
집계시        int64
출발영업소코드    int64
도착영업소코드    int64
통행시간       int64
요일         int64
dtype: object